RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Src/stm32h7rsxx_hal_mmc.c
    /* Write Multi Block command */
    errorstate = SDMMC_CmdReadMultiBlock(hmmc->Instance, 0);

    if (errorstate != HAL_MMC_ERROR_NONE)
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= errorstate;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }

    /* Clear all the static flags */
    __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS);
    /* Poll on SDMMC flags */
    tempbuff = zero_pack;

    byte_count = 0;
    dataremaining = config.DataLength;
    while (!__HAL_MMC_GET_FLAG(hmmc,
                               SDMMC_FLAG_RXOVERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND))
    {
      if (__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_RXFIFOHF) && (dataremaining >= SDMMC_FIFO_SIZE))
      {
        /* Read data from SDMMC Rx FIFO */
        for (count = 0U; count < (SDMMC_FIFO_SIZE / 4U); count++)
        {
          data = SDMMC_ReadFIFO(hmmc->Instance);
          *tempbuff = (uint8_t)(data & 0xFFU);
          tempbuff++;
          byte_count++;
          *tempbuff = (uint8_t)((data >> 8U) & 0xFFU);
          tempbuff++;
          byte_count++;
          *tempbuff = (uint8_t)((data >> 16U) & 0xFFU);
          tempbuff++;
          byte_count++;
          *tempbuff = (uint8_t)((data >> 24U) & 0xFFU);
          tempbuff++;
          byte_count++;
          if (byte_count < MMC_RPMB_NONCE_POSITION)
          {
            tempbuff = zero_pack;
          }
          else if (byte_count == MMC_RPMB_NONCE_POSITION)
          {
            tempbuff = echo_nonce;
          }
          else if (byte_count == MMC_RPMB_WRITE_COUNTER_POSITION)
          {
            tempbuff = tail_pack;
          }
          else
          {
            /* Nothing to do */
          }
        }
        dataremaining -= SDMMC_FIFO_SIZE;
      }

      if (((HAL_GetTick() - tickstart) >=  Timeout) || (Timeout == 0U))
      {
        /* Clear all the static flags */
        __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
        hmmc->ErrorCode |= HAL_MMC_ERROR_TIMEOUT;
        hmmc->State = HAL_MMC_STATE_READY;
        return HAL_TIMEOUT;
      }
    }
    __SDMMC_CMDTRANS_DISABLE(hmmc->Instance);

    /* Get error state */
    if (__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DTIMEOUT))
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_TIMEOUT;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }
    else if (__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_DCRCFAIL))
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= HAL_MMC_ERROR_DATA_CRC_FAIL;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }
    else if (__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_TXUNDERR))
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= HAL_MMC_ERROR_TX_UNDERRUN;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }
    else
    {
      /* Nothing to do */
    }

    /* Clear all the static flags */
    __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_DATA_FLAGS);

    hmmc->State = HAL_MMC_STATE_READY;

    for (uint8_t i = 0; i < 16U; i++)
    {
      if (local_nonce[i] != echo_nonce[i])
      {
        return HAL_ERROR;
      }
    }
  }
  else
  {
    hmmc->ErrorCode |= HAL_MMC_ERROR_BUSY;
    return HAL_ERROR;
  }
  tail_pack[11]  = 0x03;
  tail_pack[10]  = 0x00;
  tail_pack[7]   = (uint8_t)(NumberOfBlocks) & 0xFFU;
  tail_pack[6]   = (uint8_t)(NumberOfBlocks >> 8) & 0xFFU;
  tail_pack[5]   = (uint8_t)(BlockAdd) & 0xFFU;
  tail_pack[4]   = (uint8_t)(BlockAdd >> 8) & 0xFFU;

  rtempbuff = zero_pack;
  byte_count = 0;
  arg |= NumberOfBlocks;

  if (hmmc->State == HAL_MMC_STATE_READY)
  {
    hmmc->ErrorCode = HAL_MMC_ERROR_NONE;


    hmmc->State = HAL_MMC_STATE_BUSY;

    /* Initialize data control register */
    hmmc->Instance->DCTRL = 0U;

    errorstate = SDMMC_CmdBlockCount(hmmc->Instance, arg);
    if (errorstate != HAL_MMC_ERROR_NONE)
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= errorstate;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }

    /* Send Request Packet */
    /* Configure the MMC DPSM (Data Path State Machine) */
    config.DataTimeOut   = SDMMC_DATATIMEOUT;
    config.DataLength    = NumberOfBlocks * MMC_BLOCKSIZE;
    config.DataBlockSize = SDMMC_DATABLOCK_SIZE_512B;
    config.TransferDir   = SDMMC_TRANSFER_DIR_TO_CARD;
    config.TransferMode  = SDMMC_TRANSFER_MODE_BLOCK;
    config.DPSM          = SDMMC_DPSM_DISABLE;
    (void)SDMMC_ConfigData(hmmc->Instance, &config);
    __SDMMC_CMDTRANS_ENABLE(hmmc->Instance);

    /* Write Blocks in Polling mode */

    {
      hmmc->Context = MMC_CONTEXT_WRITE_MULTIPLE_BLOCK;

      /* Write Multi Block command */
      errorstate = SDMMC_CmdWriteMultiBlock(hmmc->Instance, 0);
    }

    if (errorstate != HAL_MMC_ERROR_NONE)
    {
      /* Clear all the static flags */
      __HAL_MMC_CLEAR_FLAG(hmmc, SDMMC_STATIC_FLAGS);
      hmmc->ErrorCode |= errorstate;
      hmmc->State = HAL_MMC_STATE_READY;
      return HAL_ERROR;
    }


    /* Write block(s) in polling mode */
    dataremaining = config.DataLength;
    while (!__HAL_MMC_GET_FLAG(hmmc,
                               SDMMC_FLAG_TXUNDERR | SDMMC_FLAG_DCRCFAIL | SDMMC_FLAG_DTIMEOUT | SDMMC_FLAG_DATAEND))
    {
      if (__HAL_MMC_GET_FLAG(hmmc, SDMMC_FLAG_TXFIFOHE) && (dataremaining >= SDMMC_FIFO_SIZE))
      {

        /* Write data to SDMMC Tx FIFO */
        for (count = 0U; count < (SDMMC_FIFO_SIZE / 4U); count++)
        {
          data = (uint32_t)(*rtempbuff);
          rtempbuff++;
          byte_count++;
          data |= ((uint32_t)(*rtempbuff) << 8U);
          rtempbuff++;
          byte_count++;
          data |= ((uint32_t)(*rtempbuff) << 16U);
          rtempbuff++;
          byte_count++;
          data |= ((uint32_t)(*rtempbuff) << 24U);
          rtempbuff++;
          byte_count++;
          (void)SDMMC_WriteFIFO(hmmc->Instance, &data);
          if (byte_count == MMC_RPMB_KEYMAC_POSITION)
          {
            rtempbuff = pMAC;
          }
          if (byte_count == MMC_RPMB_DATA_POSITION)
          {
            rtempbuff = &pData[offset];
          }
          if ((byte_count >= MMC_RPMB_NONCE_POSITION) && \
              (byte_count < MMC_RPMB_WRITE_COUNTER_POSITION))
          {
            rtempbuff = zero_pack;
          }
          if (byte_count == MMC_RPMB_WRITE_COUNTER_POSITION)
          {
            rtempbuff = tail_pack;
          }
          else if (byte_count == MMC_BLOCKSIZE)
          {
            offset += (uint32_t)256U;
            byte_count = 0;
          }
          else
          {
            /* Nothing to do */
          }
        }
        dataremaining -= SDMMC_FIFO_SIZE;
      }

